Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4ecb/atdf/ATSAM4E16CB.atdf
        <register caption="DMAC Channel Control A Register (ch_num = 3)" name="DMAC_CTRLA3" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Size" mask="0x0000FFFF" name="BTSIZE"/>
          <bitfield caption="Transfer Width for the Source" mask="0x03000000" name="SRC_WIDTH" values="DMAC_CTRLA3__SRC_WIDTH"/>
          <bitfield caption="Transfer Width for the Destination" mask="0x30000000" name="DST_WIDTH" values="DMAC_CTRLA3__DST_WIDTH"/>
          <bitfield caption="Current Descriptor Stop Command and Transfer Completed Memory Indicator" mask="0x80000000" name="DONE"/>
        </register>
        <register caption="DMAC Channel Control B Register (ch_num = 3)" name="DMAC_CTRLB3" offset="0xC4" rw="RW" size="4">
          <bitfield caption="Source Address Descriptor" mask="0x00010000" name="SRC_DSCR" values="DMAC_CTRLB3__SRC_DSCR"/>
          <bitfield caption="Destination Address Descriptor" mask="0x00100000" name="DST_DSCR" values="DMAC_CTRLB3__DST_DSCR"/>
          <bitfield caption="Flow Control" mask="0x00600000" name="FC" values="DMAC_CTRLB3__FC"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Source" mask="0x03000000" name="SRC_INCR" values="DMAC_CTRLB3__SRC_INCR"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Destination" mask="0x30000000" name="DST_INCR" values="DMAC_CTRLB3__DST_INCR"/>
          <bitfield caption="Interrupt Enable Not" mask="0x40000000" name="IEN"/>
        </register>
        <register caption="DMAC Channel Configuration Register (ch_num = 3)" name="DMAC_CFG3" offset="0xC8" rw="RW" size="4">
          <bitfield caption="Source with Peripheral identifier" mask="0x0000000F" name="SRC_PER"/>
          <bitfield caption="Destination with Peripheral identifier" mask="0x000000F0" name="DST_PER"/>
          <bitfield caption="Software or Hardware Selection for the Source" mask="0x00000200" name="SRC_H2SEL" values="DMAC_CFG3__SRC_H2SEL"/>
          <bitfield caption="Software or Hardware Selection for the Destination" mask="0x00002000" name="DST_H2SEL" values="DMAC_CFG3__DST_H2SEL"/>
          <bitfield caption="Stop On Done" mask="0x00010000" name="SOD" values="DMAC_CFG3__SOD"/>
          <bitfield caption="Interface Lock" mask="0x00100000" name="LOCK_IF" values="DMAC_CFG3__LOCK_IF"/>
          <bitfield caption="Bus Lock" mask="0x00200000" name="LOCK_B" values="DMAC_CFG3__LOCK_B"/>
          <bitfield caption="Master Interface Arbiter Lock" mask="0x00400000" name="LOCK_IF_L" values="DMAC_CFG3__LOCK_IF_L"/>
          <bitfield caption="AHB Protection" mask="0x07000000" name="AHB_PROT"/>
          <bitfield caption="FIFO Configuration" mask="0x30000000" name="FIFOCFG" values="DMAC_CFG3__FIFOCFG"/>
        </register>
        <register caption="DMAC Write Protect Mode Register" name="DMAC_WPMR" offset="0x1E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY" values="DMAC_WPMR__WPKEY"/>
        </register>
        <register caption="DMAC Write Protect Status Register" name="DMAC_WPSR" offset="0x1E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        </register-group>
      <value-group caption="" name="DMAC_GCFG__ARB_CFG">
        <value caption="Fixed priority arbiter (see &#34;Basic Definitions&#34; )" name="FIXED" value="0"/>
        <value caption="Modified round robin arbiter." name="ROUND_ROBIN" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA0__SRC_WIDTH">
        <value caption="the transfer size is set to 8-bit width" name="BYTE" value="0x0"/>
        <value caption="the transfer size is set to 16-bit width" name="HALF_WORD" value="0x1"/>
        <value caption="the transfer size is set to 32-bit width" name="WORD" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLA0__DST_WIDTH">
        <value caption="the transfer size is set to 8-bit width" name="BYTE" value="0x0"/>
        <value caption="the transfer size is set to 16-bit width" name="HALF_WORD" value="0x1"/>
        <value caption="the transfer size is set to 32-bit width" name="WORD" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB0__SRC_DSCR">
        <value caption="Source address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the source." name="FETCH_DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB0__DST_DSCR">
        <value caption="Destination address is updated when the descriptor is fetched from the memory." name="FETCH_FROM_MEM" value="0"/>
        <value caption="Buffer Descriptor Fetch operation is disabled for the destination." name="FETCH_DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB0__FC">
        <value caption="Memory-to-Memory Transfer DMAC is flow controller" name="MEM2MEM_DMA_FC" value="0x0"/>
        <value caption="Memory-to-Peripheral Transfer DMAC is flow controller" name="MEM2PER_DMA_FC" value="0x1"/>
        <value caption="Peripheral-to-Memory Transfer DMAC is flow controller" name="PER2MEM_DMA_FC" value="0x2"/>
        <value caption="Peripheral-to-Peripheral Transfer DMAC is flow controller" name="PER2PER_DMA_FC" value="0x3"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB0__SRC_INCR">
        <value caption="The source address is incremented" name="INCREMENTING" value="0x0"/>
        <value caption="The source address is decremented" name="DECREMENTING" value="0x1"/>
        <value caption="The source address remains unchanged" name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CTRLB0__DST_INCR">
        <value caption="The destination address is incremented" name="INCREMENTING" value="0x0"/>
        <value caption="The destination address is decremented" name="DECREMENTING" value="0x1"/>
        <value caption="The destination address remains unchanged" name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__SRC_H2SEL">
        <value caption="Software handshaking interface is used to trigger a transfer request." name="SW" value="0"/>
        <value caption="Hardware handshaking interface is used to trigger a transfer request." name="HW" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__DST_H2SEL">
        <value caption="Software handshaking interface is used to trigger a transfer request." name="SW" value="0"/>
        <value caption="Hardware handshaking interface is used to trigger a transfer request." name="HW" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__SOD">
        <value caption="STOP ON DONE disabled, the descriptor fetch operation ignores DONE Field of CTRLA register." name="DISABLE" value="0"/>
        <value caption="STOP ON DONE activated, the DMAC module is automatically disabled if DONE FIELD is set to 1." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__LOCK_IF">
        <value caption="Interface Lock capability is disabled" name="DISABLE" value="0"/>
        <value caption="Interface Lock capability is enabled" name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="DMAC_CFG0__LOCK_B">
        <value caption="AHB Bus Locking capability is disabled." name="DISABLE" value="0"/>
      </value-group>
