Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4ecb/atdf/ATSAM4E16CB.atdf
      <value-group caption="" name="EEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
    </module>
    <module name="GPBR" caption="General Purpose Backup Registers" id="6378" version="F">
      <register-group name="GPBR"><register caption="General Purpose Backup Register 0" name="SYS_GPBR0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 1" name="SYS_GPBR1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 2" name="SYS_GPBR2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 3" name="SYS_GPBR3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 4" name="SYS_GPBR4" offset="0x10" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 5" name="SYS_GPBR5" offset="0x14" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 6" name="SYS_GPBR6" offset="0x18" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 7" name="SYS_GPBR7" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 8" name="SYS_GPBR8" offset="0x20" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 9" name="SYS_GPBR9" offset="0x24" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 10" name="SYS_GPBR10" offset="0x28" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 11" name="SYS_GPBR11" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 12" name="SYS_GPBR12" offset="0x30" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 13" name="SYS_GPBR13" offset="0x34" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 14" name="SYS_GPBR14" offset="0x38" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 15" name="SYS_GPBR15" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 16" name="SYS_GPBR16" offset="0x40" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 17" name="SYS_GPBR17" offset="0x44" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 18" name="SYS_GPBR18" offset="0x48" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 19" name="SYS_GPBR19" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        </register-group>
    </module>
    <module name="HSMCI" caption="High Speed MultiMedia Card Interface" id="6449" version="O">
      <register-group name="HSMCI"><register caption="Control Register" name="HSMCI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Multi-Media Interface Enable" mask="0x00000001" name="MCIEN"/>
          <bitfield caption="Multi-Media Interface Disable" mask="0x00000002" name="MCIDIS"/>
          <bitfield caption="Power Save Mode Enable" mask="0x00000004" name="PWSEN"/>
          <bitfield caption="Power Save Mode Disable" mask="0x00000008" name="PWSDIS"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="HSMCI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x000000FF" name="CLKDIV"/>
          <bitfield caption="Power Saving Divider" mask="0x00000700" name="PWSDIV"/>
          <bitfield caption="Read Proof Enable" mask="0x00000800" name="RDPROOF"/>
          <bitfield caption="Write Proof Enable" mask="0x00001000" name="WRPROOF"/>
          <bitfield caption="Force Byte Transfer" mask="0x00002000" name="FBYTE"/>
          <bitfield caption="Padding Value" mask="0x00004000" name="PADV"/>
          <bitfield caption="PDC-oriented Mode" mask="0x00008000" name="PDCMODE"/>
          <bitfield caption="Clock divider is odd" mask="0x00010000" name="CLKODD"/>
        </register>
