Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4ecb/atdf/ATSAM4E16CB.atdf
        <register caption="PWM Output Selection Set Register" name="PWM_OSS" offset="0x4C" rw="W" size="4">
          <bitfield caption="Output Selection Set for PWMH output of the channel 0" mask="0x00000001" name="OSSH0"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 1" mask="0x00000002" name="OSSH1"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 2" mask="0x00000004" name="OSSH2"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 3" mask="0x00000008" name="OSSH3"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 0" mask="0x00010000" name="OSSL0"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 1" mask="0x00020000" name="OSSL1"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 2" mask="0x00040000" name="OSSL2"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 3" mask="0x00080000" name="OSSL3"/>
        </register>
        <register caption="PWM Output Selection Clear Register" name="PWM_OSC" offset="0x50" rw="W" size="4">
          <bitfield caption="Output Selection Clear for PWMH output of the channel 0" mask="0x00000001" name="OSCH0"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 1" mask="0x00000002" name="OSCH1"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 2" mask="0x00000004" name="OSCH2"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 3" mask="0x00000008" name="OSCH3"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 0" mask="0x00010000" name="OSCL0"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 1" mask="0x00020000" name="OSCL1"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 2" mask="0x00040000" name="OSCL2"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 3" mask="0x00080000" name="OSCL3"/>
        </register>
        <register caption="PWM Output Selection Set Update Register" name="PWM_OSSUPD" offset="0x54" rw="W" size="4">
          <bitfield caption="Output Selection Set for PWMH output of the channel 0" mask="0x00000001" name="OSSUPH0"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 1" mask="0x00000002" name="OSSUPH1"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 2" mask="0x00000004" name="OSSUPH2"/>
          <bitfield caption="Output Selection Set for PWMH output of the channel 3" mask="0x00000008" name="OSSUPH3"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 0" mask="0x00010000" name="OSSUPL0"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 1" mask="0x00020000" name="OSSUPL1"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 2" mask="0x00040000" name="OSSUPL2"/>
          <bitfield caption="Output Selection Set for PWML output of the channel 3" mask="0x00080000" name="OSSUPL3"/>
        </register>
        <register caption="PWM Output Selection Clear Update Register" name="PWM_OSCUPD" offset="0x58" rw="W" size="4">
          <bitfield caption="Output Selection Clear for PWMH output of the channel 0" mask="0x00000001" name="OSCUPH0"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 1" mask="0x00000002" name="OSCUPH1"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 2" mask="0x00000004" name="OSCUPH2"/>
          <bitfield caption="Output Selection Clear for PWMH output of the channel 3" mask="0x00000008" name="OSCUPH3"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 0" mask="0x00010000" name="OSCUPL0"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 1" mask="0x00020000" name="OSCUPL1"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 2" mask="0x00040000" name="OSCUPL2"/>
          <bitfield caption="Output Selection Clear for PWML output of the channel 3" mask="0x00080000" name="OSCUPL3"/>
        </register>
        <register caption="PWM Fault Mode Register" name="PWM_FMR" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Fault Polarity" mask="0x000000FF" name="FPOL"/>
          <bitfield caption="Fault Activation Mode" mask="0x0000FF00" name="FMOD"/>
          <bitfield caption="Fault Filtering" mask="0x00FF0000" name="FFIL"/>
        </register>
        <register caption="PWM Fault Status Register" name="PWM_FSR" offset="0x60" rw="R" size="4">
          <bitfield caption="Fault Input Value" mask="0x000000FF" name="FIV"/>
          <bitfield caption="Fault Status" mask="0x0000FF00" name="FS"/>
        </register>
        <register caption="PWM Fault Clear Register" name="PWM_FCR" offset="0x64" rw="W" size="4">
          <bitfield caption="Fault Clear" mask="0x000000FF" name="FCLR"/>
        </register>
        <register caption="PWM Fault Protection Value Register" name="PWM_FPV" offset="0x68" rw="RW" size="4">
          <bitfield caption="Fault Protection Value for PWMH output on channel 0" mask="0x00000001" name="FPVH0"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 1" mask="0x00000002" name="FPVH1"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 2" mask="0x00000004" name="FPVH2"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 3" mask="0x00000008" name="FPVH3"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 0" mask="0x00010000" name="FPVL0"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 1" mask="0x00020000" name="FPVL1"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 2" mask="0x00040000" name="FPVL2"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 3" mask="0x00080000" name="FPVL3"/>
        </register>
        <register caption="PWM Fault Protection Enable Register" name="PWM_FPE" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Fault Protection Enable for channel 0" mask="0x000000FF" name="FPE0"/>
          <bitfield caption="Fault Protection Enable for channel 1" mask="0x0000FF00" name="FPE1"/>
          <bitfield caption="Fault Protection Enable for channel 2" mask="0x00FF0000" name="FPE2"/>
          <bitfield caption="Fault Protection Enable for channel 3" mask="0xFF000000" name="FPE3"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register 0" name="PWM_ELMR0" offset="0x7C" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register 1" name="PWM_ELMR1" offset="0x80" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Spread Spectrum Register" name="PWM_SSPR" offset="0xA0" rw="RW" size="4">
          <bitfield caption="Spread Spectrum Limit Value" mask="0x00FFFFFF" name="SPRD"/>
          <bitfield caption="Spread Spectrum Counter Mode" mask="0x01000000" name="SPRDM"/>
        </register>
